In [2]:
import numpy as np # linear algebra
import pandas as pd # data processing, CSV file I/O (e.g. pd.read_csv)

# Input data files are available in the read-only "../input/" directory
# For example, running this (by clicking run or pressing Shift+Enter) will list all files under the input directory

import os
for dirname, _, filenames in os.walk('Historical_Product_Demand.csv'):
    for filename in filenames:
        print(os.path.join(dirname, filename))

In [3]:
import seaborn as sb
import matplotlib.pyplot as plt
from scipy.stats import norm, skew #for some statistics
from scipy import stats #qqplot
import statsmodels.api as sm #for decomposing the trends, seasonality etc.
from statsmodels.tsa.statespace.sarimax import SARIMAX #the big daddy

In [4]:
df = pd.read_csv('Historical_Product_Demand.csv')
df.head(10)

   Product_Code Warehouse Product_Category       Date Order_Demand
0  Product_0993    Whse_J     Category_028  2012/7/27         100
1  Product_0979    Whse_J     Category_028  2012/1/19         500
2  Product_0979    Whse_J     Category_028   2012/2/3         500
3  Product_0979    Whse_J     Category_028   2012/2/9         500
4  Product_0979    Whse_J     Category_028   2012/3/2         500
5  Product_0979    Whse_J     Category_028  2012/4/19         500
6  Product_0979    Whse_J     Category_028   2012/6/5         500
7  Product_0979    Whse_J     Category_028  2012/6/27         500
8  Product_0979    Whse_J     Category_028  2012/7/23         500
9  Product_0979    Whse_J     Category_028  2012/8/29         500

In [5]:
df.describe()

        Product_Code Warehouse Product_Category       Date Order_Demand
count        1048575   1048575          1048575    1037336      1048575
unique          2160         4               33       1729         3828
top     Product_1359    Whse_J     Category_019  2013/9/27        1000
freq           16936    764447           481099       2075       112682

In [8]:
df.dtypes

Product_Code        object
Warehouse           object
Product_Category    object
Date                object
Order_Demand        object
dtype: object

In [9]:
df.shape

(1048575, 5)

In [10]:
df.isnull()

         Product_Code  Warehouse  Product_Category   Date  Order_Demand
0               False      False             False  False         False
1               False      False             False  False         False
2               False      False             False  False         False
3               False      False             False  False         False
4               False      False             False  False         False
...               ...        ...               ...    ...           ...
1048570         False      False             False  False         False
1048571         False      False             False  False         False
1048572         False      False             False  False         False
1048573         False      False             False  False         False
1048574         False      False             False  False         False

[1048575 rows x 5 columns]

In [11]:
df.dropna()

         Product_Code Warehouse Product_Category       Date Order_Demand
0        Product_0993    Whse_J     Category_028  2012/7/27         100
1        Product_0979    Whse_J     Category_028  2012/1/19         500
2        Product_0979    Whse_J     Category_028   2012/2/3         500
3        Product_0979    Whse_J     Category_028   2012/2/9         500
4        Product_0979    Whse_J     Category_028   2012/3/2         500
...               ...       ...              ...        ...          ...
1048570  Product_1791    Whse_J     Category_006  2016/4/27        1000
1048571  Product_1974    Whse_J     Category_006  2016/4/27           1
1048572  Product_1787    Whse_J     Category_006  2016/4/28        2500
1048573  Product_0901    Whse_J     Category_023  2016/10/7          50
1048574  Product_0704    Whse_J     Category_001  2016/6/27           4

[1037336 rows x 5 columns]

In [20]:
wh_df = df[df["Warehouse"] == "Whse_A"].groupby(["Warehouse", "Date"])["Order_Demand"].sum().reset_index()
wh_df.head(5)

  Warehouse        Date Order_Demand
0    Whse_A    2011/1/8           2
1    Whse_A  2011/11/18      4000 1
2    Whse_A  2011/11/21   3 5 2 100
3    Whse_A  2011/11/22        3700
4    Whse_A  2011/11/23    1000 200